In [1]:
import pandas as pd

In [2]:
exam = pd.read_csv('exam.csv')

In [7]:
exam.query('nclass == 1')[['math']]

   math
0    50
1    60
2    45
3    30

In [8]:
exam.query('math > = 50')[['id','math']]

    id  math
0    1    50
1    2    60
5    6    50
6    7    80
7    8    90
9   10    50
10  11    65
14  15    75
15  16    58
16  17    65
17  18    80
18  19    89
19  20    78

In [9]:
exam.query('math > = 50')[['id','math']].head()

   id  math
0   1    50
1   2    60
5   6    50
6   7    80
7   8    90

##### Q1. mpg 데이터는 11개 변수로 구성됩니다. 이 중 일부만 추출해 분석에 활용하려고 합니다. mpg데이터에서 category(자동차 종류),cty(도시 연비) 변수를 추출해 새로운 데이터를 만드세요. 새로 만든 데이터의 일부를 출력해 두 변수로만 구성되어있는지 확인하세요.

In [10]:
mpg = pd.read_csv('mpg.csv')

In [11]:
mpg_n = mpg[['category','cty']]

In [12]:
mpg_n

    category  cty
0    compact   18
1    compact   21
2    compact   20
3    compact   21
4    compact   16
..       ...  ...
229  midsize   19
230  midsize   21
231  midsize   16
232  midsize   18
233  midsize   17

[234 rows x 2 columns]

##### Q2.자동차 종류에 따라 도시 연비가 어떻게 다른지 알아보려고합니다. 앞에서 추출한 데이터를 이용해 category(자동차 종류)가 'suv'인 자동차와 'compact'인 자동차 중 어떤 자동차의 cty(도시 연비) 평균이 높은지 알아보세요.

In [14]:
suv_cty = mpg.query('category == "suv"')['cty']

In [15]:
compact_cty = mpg.query('category == "compact"')['cty']

In [16]:
suv_cty.mean()

13.5

In [17]:
compact_cty.mean()

20.127659574468087